; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 9 parts and 150% wood
; Machines:
;   2 highspeed-saw
;   2 glazer
;   2 grinder
;   2 immersion-varnisher
;   2 planer
;   2 saw
;   2 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 - highspeed-saw
    glazer0 glazer1 - glazer
    grinder0 grinder1 - grinder
    immersion-varnisher0 immersion-varnisher1 - immersion-varnisher
    planer0 planer1 - planer
    saw0 saw1 - saw
    spray-varnisher0 spray-varnisher1 - spray-varnisher
    red black green mauve blue white - acolour
    pine walnut - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 - part
    b0 b1 b2 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (boardsize-successor s9 s10)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (has-colour glazer0 mauve)
    (has-colour glazer0 red)
    (has-colour glazer0 white)
    (has-colour glazer1 mauve)
    (has-colour immersion-varnisher0 natural)
    (has-colour immersion-varnisher0 red)
    (has-colour immersion-varnisher0 white)
    (has-colour immersion-varnisher1 natural)
    (has-colour immersion-varnisher1 white)
    (has-colour spray-varnisher0 natural)
    (has-colour spray-varnisher0 white)
    (has-colour spray-varnisher1 natural)
    (has-colour spray-varnisher1 red)
    (has-colour spray-varnisher1 white)
    (unused p0)
    (goalsize p0 medium)
    (= (spray-varnish-cost p0) 10)
    (= (glaze-cost p0) 15)
    (= (grind-cost p0) 30)
    (= (plane-cost p0) 20)
    (unused p1)
    (goalsize p1 medium)
    (= (spray-varnish-cost p1) 10)
    (= (glaze-cost p1) 15)
    (= (grind-cost p1) 30)
    (= (plane-cost p1) 20)
    (unused p2)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (unused p3)
    (goalsize p3 small)
    (= (spray-varnish-cost p3) 5)
    (= (glaze-cost p3) 10)
    (= (grind-cost p3) 15)
    (= (plane-cost p3) 10)
    (unused p4)
    (goalsize p4 large)
    (= (spray-varnish-cost p4) 15)
    (= (glaze-cost p4) 20)
    (= (grind-cost p4) 45)
    (= (plane-cost p4) 30)
    (unused p5)
    (goalsize p5 medium)
    (= (spray-varnish-cost p5) 10)
    (= (glaze-cost p5) 15)
    (= (grind-cost p5) 30)
    (= (plane-cost p5) 20)
    (available p6)
    (treatment p6 varnished)
    (surface-condition p6 smooth)
    (wood p6 pine)
    (colour p6 green)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 small)
    (= (spray-varnish-cost p7) 5)
    (= (glaze-cost p7) 10)
    (= (grind-cost p7) 15)
    (= (plane-cost p7) 10)
    (available p8)
    (treatment p8 varnished)
    (surface-condition p8 rough)
    (wood p8 walnut)
    (colour p8 blue)
    (goalsize p8 medium)
    (= (spray-varnish-cost p8) 10)
    (= (glaze-cost p8) 15)
    (= (grind-cost p8) 30)
    (= (plane-cost p8) 20)
    (boardsize b0 s7)
    (wood b0 pine)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s10)
    (wood b1 pine)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s3)
    (wood b2 walnut)
    (surface-condition b2 rough)
    (available b2)
  )
  (:goal
    (and
    (available p0)
    (surface-condition p0 smooth)
    (colour p0 red)
    (available p1)
    (wood p1 pine)
    (treatment p1 glazed)
    (available p2)
    (colour p2 white)
    (treatment p2 varnished)
    (available p3)
    (surface-condition p3 verysmooth)
    (colour p3 mauve)
    (treatment p3 glazed)
    (available p4)
    (wood p4 pine)
    (colour p4 white)
    (surface-condition p4 verysmooth)
    (treatment p4 varnished)
    (available p5)
    (wood p5 pine)
    (colour p5 white)
    (surface-condition p5 verysmooth)
    (available p6)
    (surface-condition p6 verysmooth)
    (colour p6 natural)
    (treatment p6 varnished)
    (available p7)
    (wood p7 walnut)
    (treatment p7 varnished)
    (available p8)
    (wood p8 walnut)
    (surface-condition p8 smooth)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b1 p3 saw0 pine rough s10 s9)
   deleted: (unused p3)
   added: (available p3) (wood p3 pine) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b1 s9)
   goals met: 5 of 32
2. (do-saw-medium b0 p1 saw0 pine rough s7 s6 s5)
   deleted: (unused p1)
   added: (available p1) (wood p1 pine) (surface-condition p1 rough) (colour p1 natural) (treatment p1 untreated) (boardsize b0 s5)
   goals met: 7 of 32
3. (do-saw-medium b0 p0 saw0 pine rough s5 s4 s3)
   deleted: (unused p0)
   added: (available p0) (wood p0 pine) (surface-condition p0 rough) (colour p0 natural) (treatment p0 untreated) (boardsize b0 s3)
   goals met: 8 of 32
4. (do-saw-large b0 p4 saw0 pine rough s3 s1 s2 s0)
   deleted: (unused p4)
   added: (available p4) (wood p4 pine) (surface-condition p4 rough) (colour p4 natural) (treatment p4 untreated) (boardsize b0 s0)
   goals met: 10 of 32
5. (do-plane p4 planer0 rough natural untreated)
   deleted: (surface-condition p4 rough)
   added: (surface-condition p4 smooth)
   goals met: 10 of 32
6. (do-plane p3 planer0 rough natural untreated)
   deleted: (surface-condition p3 rough)
   added: (surface-condition p3 smooth)
   goals met: 10 of 32
7. (do-plane p0 planer0 rough natural untreated)
   deleted: (surface-condition p0 rough)
   added: (surface-condition p0 smooth)
   goals met: 11 of 32
8. (do-grind p4 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p4 smooth)
   added: (surface-condition p4 verysmooth)
   goals met: 12 of 32
9. (do-grind p3 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p3 smooth)
   added: (surface-condition p3 verysmooth)
   goals met: 13 of 32
10. (do-glaze p3 glazer0 mauve)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 mauve)
   goals met: 15 of 32
11. (do-glaze p1 glazer0 mauve)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 glazed) (colour p1 mauve)
   goals met: 16 of 32
12. (do-glaze p0 glazer0 red)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 glazed) (colour p0 red)
   goals met: 17 of 32
13. (do-grind p6 grinder0 smooth green varnished colourfragments)
   deleted: (surface-condition p6 smooth) (treatment p6 varnished) (colour p6 green)
   added: (surface-condition p6 verysmooth) (treatment p6 colourfragments) (colour p6 natural)
   goals met: 18 of 32
14. (do-grind p6 grinder0 verysmooth natural colourfragments untreated)
   deleted: (treatment p6 colourfragments)
   added: (treatment p6 untreated)
   goals met: 18 of 32
15. (do-immersion-varnish p4 immersion-varnisher0 white verysmooth)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 varnished) (colour p4 white)
   goals met: 20 of 32
16. (do-immersion-varnish p6 immersion-varnisher0 natural verysmooth)
   deleted: (treatment p6 untreated)
   added: (treatment p6 varnished)
   goals met: 21 of 32
17. (do-plane p8 planer0 rough blue varnished)
   deleted: (surface-condition p8 rough) (treatment p8 varnished) (colour p8 blue)
   added: (surface-condition p8 smooth) (treatment p8 untreated) (colour p8 natural)
   goals met: 22 of 32
18. (do-saw-medium b1 p2 saw0 pine rough s9 s8 s7)
   deleted: (unused p2)
   added: (available p2) (wood p2 pine) (surface-condition p2 rough) (colour p2 natural) (treatment p2 untreated) (boardsize b1 s7)
   goals met: 23 of 32
19. (do-plane p2 planer0 rough natural untreated)
   deleted: (surface-condition p2 rough)
   added: (surface-condition p2 smooth)
   goals met: 23 of 32
20. (do-immersion-varnish p2 immersion-varnisher0 white smooth)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 varnished) (colour p2 white)
   goals met: 25 of 32
21. (do-saw-medium b1 p5 saw0 pine rough s7 s6 s5)
   deleted: (unused p5)
   added: (available p5) (wood p5 pine) (surface-condition p5 rough) (colour p5 natural) (treatment p5 untreated) (boardsize b1 s5)
   goals met: 27 of 32
22. (do-plane p5 planer0 rough natural untreated)
   deleted: (surface-condition p5 rough)
   added: (surface-condition p5 smooth)
   goals met: 27 of 32
23. (do-grind p5 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p5 smooth)
   added: (surface-condition p5 verysmooth)
   goals met: 28 of 32
24. (do-glaze p5 glazer0 white)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 glazed) (colour p5 white)
   goals met: 29 of 32
25. (do-saw-small b2 p7 saw0 walnut rough s3 s2)
   deleted: (unused p7)
   added: (available p7) (wood p7 walnut) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b2 s2)
   goals met: 31 of 32
26. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 31 of 32
27. (do-immersion-varnish p7 immersion-varnisher0 natural smooth)
   deleted: (treatment p7 untreated)
   added: (treatment p7 varnished)
   goals met: 32 of 32
